services/payment-connector/service/src/tests/resources/webhook-charge.refunded-partial.json

{
  "id": "evt_3LKzMCF25jWjUFkW1R7V7sqz",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1657695440,
  "data": {
    "object": {
      "id": "ch_3LKzMCF25jWjUFkW1KT5BnwW",
      "object": "charge",
      "amount": 99,
      "amount_captured": 99,
      "amount_refunded": 33,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": "txn_3LKzMCF25jWjUFkW1lCDOHRs",
      "billing_details": {
        "address": {
          "city": null,
          "country": "DE",
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": "Sheila35@example.com",
        "name": "Sheila Graham",
        "phone": null
      },
      "calculated_statement_descriptor": "Stripe",
      "captured": true,
      "created": 1657694857,
      "currency": "eur",
      "customer": "cus_M2m5b0whLiH5AL",
      "description": "Subscription creation",
      "destination": null,
      "dispute": null,
      "disputed": false,
      "failure_balance_transaction": null,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {},
      "invoice": "in_1LKzMBF25jWjUFkWxcX1B2Za",
      "livemode": false,
      "metadata": {},
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "risk_score": 27,
        "seller_message": "Payment complete.",
        "type": "authorized"
      },
      "paid": true,
      "payment_intent": "pi_3LKzMCF25jWjUFkW1yXxuMgq",
      "payment_method": "pm_1LKgadF25jWjUFkWiIbDsykA",
      "payment_method_details": {
        "card": {
          "brand": "visa",
          "checks": {
            "address_line1_check": null,
            "address_postal_code_check": null,
            "cvc_check": null
          },
          "country": "US",
          "exp_month": 1,
          "exp_year": 2023,
          "fingerprint": "hI9xdYdQiYyePQEH",
          "funding": "credit",
          "installments": null,
          "last4": "4242",
          "mandate": null,
          "network": "visa",
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "receipt_email": null,
      "receipt_number": null,
      "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xTEtjUEZGMjVqV2pVRmtXKNDZuZYGMgYgnCWaqMA6LBbR70EtFmQxqLvwqHjYOd0QMmrOMSHnW8tGMAiepsijCA32v7IOGspQW4NL?s=ap",
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [
          {
            "id": "re_3LKzMCF25jWjUFkW1JyryP3W",
            "object": "refund",
            "amount": 33,
            "balance_transaction": "txn_3LKzMCF25jWjUFkW1MzAypu7",
            "charge": "ch_3LKzMCF25jWjUFkW1KT5BnwW",
            "created": 1657695439,
            "currency": "eur",
            "metadata": {},
            "payment_intent": "pi_3LKzMCF25jWjUFkW1yXxuMgq",
            "reason": "requested_by_customer",
            "receipt_number": null,
            "source_transfer_reversal": null,
            "status": "succeeded",
            "transfer_reversal": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges/ch_3LKzMCF25jWjUFkW1KT5BnwW/refunds"
      },
      "review": null,
      "shipping": null,
      "source": null,
      "source_transfer": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    },
    "previous_attributes": {
      "amount_refunded": 0,
      "receipt_url": "https://pay.stripe.com/receipts/invoices/CAcaFwoVYWNjdF8xTEtjUEZGMjVqV2pVRmtXKM_ZuZYGMgb4WebGmos6LBYYuLHUSBdwfYuQzNdia_1cEVMKrReaZ8AaP7L_CD-kDp9IxrOcGuNeNUkY?s=ap",
      "refunds": { "data": [], "total_count": 0 }
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_tKDwXWDYWRtlSF",
    "idempotency_key": "9fdf1b57-9aba-44f8-8ab5-c51a57273a28"
  },
  "type": "charge.refunded"
}
