services/payment-connector/service/src/tests/resources/webhook-customer.subscription.updated-cancelled.json

{
  "id": "evt_1LKzRXF25jWjUFkWfG1UYTIZ",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1657695187,
  "data": {
    "object": {
      "id": "sub_1LKzMBF25jWjUFkWsmYTumfm",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": { "enabled": false },
      "billing_cycle_anchor": 1657694855,
      "billing_thresholds": null,
      "cancel_at": 1657781255,
      "cancel_at_period_end": true,
      "canceled_at": 1657695187,
      "collection_method": "charge_automatically",
      "created": 1657694855,
      "current_period_end": 1657781255,
      "current_period_start": 1657694855,
      "customer": "cus_M2m5b0whLiH5AL",
      "days_until_due": null,
      "default_payment_method": "pm_1LKgadF25jWjUFkWiIbDsykA",
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_M35XYfnBl36GDs",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1657694856,
            "metadata": {},
            "plan": {
              "id": "price_1LKcfkF25jWjUFkWM6hJuKRr",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 99,
              "amount_decimal": "99",
              "billing_scheme": "per_unit",
              "created": 1657607656,
              "currency": "eur",
              "interval": "day",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_M2i5LKyU5HRXBn",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1LKcfkF25jWjUFkWM6hJuKRr",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1657607656,
              "currency": "eur",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_M2i5LKyU5HRXBn",
              "recurring": {
                "aggregate_usage": null,
                "interval": "day",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 99,
              "unit_amount_decimal": "99"
            },
            "quantity": 1,
            "subscription": "sub_1LKzMBF25jWjUFkWsmYTumfm",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1LKzMBF25jWjUFkWsmYTumfm"
      },
      "latest_invoice": "in_1LKzMBF25jWjUFkWxcX1B2Za",
      "livemode": false,
      "metadata": {
        "source": "session.subscription_data",
        "subscriptionId": "da6cdb9d-822c-4a33-8953-39a34bd6bc71"
      },
      "next_pending_invoice_item_invoice": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_1LKcfkF25jWjUFkWM6hJuKRr",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 99,
        "amount_decimal": "99",
        "billing_scheme": "per_unit",
        "created": 1657607656,
        "currency": "eur",
        "interval": "day",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": null,
        "product": "prod_M2i5LKyU5HRXBn",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1657694855,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_dyIujHNn7iLDWW",
    "idempotency_key": "b2610d85-1b8f-4f7e-ad45-4b4fe0edeb7c"
  },
  "type": "customer.subscription.updated"
}
