services/payment-connector/service/src/tests/resources/webhook-invoice.payment_succeeded.json

{
  "id": "evt_1LKzaLF25jWWea343adfr",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1657694856,
  "data": {
    "object": {
      "id": "in_1LKzMBF25jWjUFkWxcX1B2Za",
      "object": "invoice",
      "account_country": "DE",
      "account_name": "Mosaic Stripe Demo",
      "account_tax_ids": null,
      "amount_due": 99,
      "amount_paid": 99,
      "amount_remaining": 0,
      "application": null,
      "application_fee_amount": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "automatic_tax": { "enabled": false, "status": null },
      "billing_reason": "subscription_create",
      "charge": "ch_3LKzMCF25jWjUFkW1KT5BnwW",
      "collection_method": "charge_automatically",
      "created": 1657694855,
      "currency": "eur",
      "custom_fields": null,
      "customer": "cus_M2m5b0whLiH5AL",
      "customer_address": null,
      "customer_email": "Sheila35@example.com",
      "customer_name": "Sheila Graham",
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1LKcPFF25jWjUFkW/test_YWNjdF8xTEtjUEZGMjVqV2pVRmtXLF9NMzVYZHM5STA1cjBiaWNFOFE3OVdxcUpTdEM2WlZ2LDQ4MjM1NjU502009mOW8jNh?s=ap",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1LKcPFF25jWjUFkW/test_YWNjdF8xTEtjUEZGMjVqV2pVRmtXLF9NMzVYZHM5STA1cjBiaWNFOFE3OVdxcUpTdEM2WlZ2LDQ4MjM1NjU502009mOW8jNh/pdf?s=ap",
      "last_finalization_error": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1LKzMBF25jWjUFkWGAgNJV8u",
            "object": "line_item",
            "amount": 99,
            "amount_excluding_tax": 99,
            "currency": "eur",
            "description": "1 × Premium Subscription (at €0.99 / day)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "livemode": false,
            "metadata": {
              "source": "session.subscription_data",
              "subscriptionId": "da6cdb9d-822c-4a33-8953-39a34bd6bc71"
            },
            "period": {
              "end": 1657781255,
              "start": 1657694855
            },
            "plan": {
              "id": "price_1LKcfkF25jWjUFkWM6hJuKRr",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 99,
              "amount_decimal": "99",
              "billing_scheme": "per_unit",
              "created": 1657607656,
              "currency": "eur",
              "interval": "day",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_M2i5LKyU5HRXBn",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1LKcfkF25jWjUFkWM6hJuKRr",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1657607656,
              "currency": "eur",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_M2i5LKyU5HRXBn",
              "recurring": {
                "aggregate_usage": null,
                "interval": "day",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 99,
              "unit_amount_decimal": "99"
            },
            "proration": false,
            "proration_details": {
              "credited_items": null
            },
            "quantity": 1,
            "subscription": "sub_1LKzMBF25jWjUFkWsmYTumfm",
            "subscription_item": "si_M35XYfnBl36GDs",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription",
            "unit_amount_excluding_tax": "99"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1LKzMBF25jWjUFkWxcX1B2Za/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "992104C0-0012",
      "on_behalf_of": null,
      "paid": true,
      "paid_out_of_band": false,
      "payment_intent": "pi_3LKzMCF25jWjUFkW1yXxuMgq",
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1657694855,
      "period_start": 1657694855,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "quote": null,
      "receipt_number": null,
      "rendering_options": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1657694855,
        "marked_uncollectible_at": null,
        "paid_at": 1657694858,
        "voided_at": null
      },
      "subscription": "sub_1LKzMBF25jWjUFkWsmYTumfm",
      "subtotal": 99,
      "subtotal_excluding_tax": 99,
      "tax": null,
      "test_clock": null,
      "total": 99,
      "total_discount_amounts": [],
      "total_excluding_tax": 99,
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_DDAwera34aserS",
    "idempotency_key": "85b5866d-e130-46ed-be7e-77551191a676"
  },
  "type": "invoice.payment_succeeded"
}
